# Development Tools
brew "git"
brew "gh" 
brew "git-open"
brew "node"
brew "nvm"
brew "pnpm"
brew "yarn"
brew "go"
brew "docker"
brew "postgresql"
brew "nginx"
brew "neovim"
brew "tree-sitter"

# Kubernetes Tools
brew "kubernetes-cli"
brew "helm"
brew "helmfile"
brew "k9s"
brew "kubectx"
brew "kubefwd"
brew "kubelogin"
brew "kubeseal"
brew "stern"

# Cloud/DevOps
brew "azure-cli"
brew "azd"
brew "vercel-cli"
brew "snyk"

# Languages & Runtimes
brew "elixir"
brew "erlang"
brew "deno"
brew "biome"
brew "pyenv"
brew "python@3.9"
brew "python@3.10"
brew "python@3.12"
brew "uv"

# CLI Utilities
brew "jq"
brew "wget"
brew "watch"
brew "ncdu"
brew "dive"
brew "direnv"
brew "z"
brew "spaceship"
brew "spotify-tui"
brew "stacc-next"

# Shell & Prompt
brew "kube-ps1"
brew "zsh-kubectl-prompt"

# System Dependencies
brew "autoconf"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "gdbm"
brew "gettext"
brew "icu4c@76"
brew "jemalloc"
brew "jpeg-turbo"
brew "krb5"
brew "libev"
brew "libidn2"
brew "libnghttp2"
brew "libpng"
brew "libsodium"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "lpeg"
brew "lua"
brew "luajit"
brew "luarocks"
brew "luv"
brew "lz4"
brew "m4"
brew "mpdecimal"
brew "msgpack"
brew "ncurses"
brew "nghttp2"
brew "oniguruma"
brew "openssl@3"
brew "pcre2"
brew "pkgconf"
brew "readline"
brew "sqlite"
brew "unibilium"
brew "unixodbc"
brew "wxwidgets"
brew "xz"
brew "zlib"
brew "zstd"

# Applications
cask "1password-cli"
cask "bruno"
cask "camunda-modeler"
cask "raycast"
cask "warp"